proera/Esp8266_Cert_Assistant/src/main.cpp
/*
 * Sistema CertMind - Cliente de Stream ESP8266 (D1 Mini)
 *
 * Versão: 2.5
 *
 * Descrição: Consome o stream SSE da API CertMind por UMA conexão HTTP
 * persistente (GET, texto claro, sem TLS) e aciona 5 LEDs (A-E) conforme
 * cada situação emitida pelo backend (test, ilegível, single, multiple,
 * yesno, dropdown, ordering, matching), o andamento do processamento no
 * servidor (evento status) e a saúde da conexão.
 *
 * O ESP8266 é apenas consumidor: abre o GET e fica escutando. Não faz POST,
 * não envia imagem, não faz request/response.
 *
 * Hardware: D1 Mini (ESP8266) + 5 LEDs (posições/letras A-E => 1-5).
 *
 * Changelog:
 *   2.5 - Robustez do SSE e do answer (validação em hardware pendente):
 *         teto próprio p/ a fase de headers (HEADERS_TIMEOUT_MS) — um half-open
 *         (servidor aceita o TCP e nunca responde) prendia o firmware em
 *         ST_HEADERS para sempre; parse numérico do status HTTP (a
 *         reason-phrase é opcional na RFC 7230 e um "HTTP/1.1 200" seco era
 *         rejeitado); validação de faixa dos slots antes do estreitamento a
 *         uint8_t (257 virava posição 1); log de "cached" (resposta do cache do
 *         servidor) e de "reason" (causa do status error); log do uso do
 *         filtro JSON no boot. Último release com alvo ESP8266/D1 Mini.
 *   2.4 - Evento "status" (LED de processamento). O servidor difunde
 *         status {"state":"solving"} antes de chamar a IA, answer ao terminar e
 *         status {"state":"idle"} em seguida (ou status {"state":"error"} se o
 *         processamento falhar, sem answer). Antes o firmware só reconhecia
 *         event: answer e descartava o status em silêncio — o andamento não
 *         aparecia em lugar nenhum. Agora: solving => LED C (do meio) piscando a
 *         250 ms até chegar answer/error/idle; error => padrão de erro; idle =>
 *         encerra o processando, mas NÃO apaga uma resposta em exibição (no fluxo
 *         normal o idle chega logo após o answer). O solving vence resposta
 *         segurada e encerra o blackout pós-boot. Se o stream cair no meio do
 *         processamento o padrão é abortado, para não esconder a queda — ao
 *         reabrir, o status inicial do servidor ressincroniza o estado.
 *   2.3 - Transporte: o corpo do SSE vem em Transfer-Encoding: chunked (Kestrel)
 *         e o parser não desmontava os frames. O chunk-size aparecia como linha
 *         solta (ignorada por sorte) e o CRLF terminador de cada chunk virava uma
 *         linha vazia espúria: quando um chunk terminava NO MEIO de uma linha
 *         "data:", a linha era cortada ali -> JSON truncado -> showError(). Só
 *         funcionava porque o Kestrel costuma emitir 1 chunk por evento. Agora
 *         SseClient::feedChunkedByte() consome size/CRLF e entrega ao montador de
 *         linhas apenas o corpo lógico. Além disso, TODO header de resposta passa
 *         a ser logado ("[SSE] < ..."): antes só a linha de status ia para a
 *         serial, e foi isso que manteve o problema de framing invisível.
 *   2.2 - Janela de boot: ao ligar, os LEDs sinalizam conexão/ocioso por
 *         LED_BOOT_BLINK_MS (5 min) e então ficam APAGADOS até a 1ª resposta do
 *         backend. O stream segue ativo (ping + logs na serial) durante o
 *         blackout — só a saída dos LEDs é suprimida. A 1ª resposta (qualquer
 *         evento answer: single/multiple/yesno/sequência/test/erro) encerra o
 *         blackout em definitivo e o fluxo normal reassume.
 *   2.1 - Correção: eventos com answerText longo (ex.: matching/ordering com
 *         setas/acentos UTF-8) não acionavam os LEDs. O parse do JSON recebia o
 *         buffer como const char*, fazendo o ArduinoJson COPIAR as strings para
 *         o pool e estourar o StaticJsonDocument (NoMemory) -> handleAnswer dava
 *         return silencioso. Agora o payload é passado como char* (buffer
 *         mutável), ativando o modo zero-copy do ArduinoJson (uso do pool caiu
 *         de ~507/512 para ~160/512). Erro de parse agora sinaliza leds.showError()
 *         em vez de falhar em silêncio. Buffers SSE ampliados 2048 -> 4096.
 *   2.0 - Polling HTTPS substituído por stream SSE persistente (WiFiClient).
 *         Máquina de estados de LED cobrindo todas as situações do backend.
 *         Reconexão automática com backoff. Removido HTTPClient/WiFiClientSecure.
 *   1.0 - Versão inicial por polling.
 *
 * Autor: Proera
 */

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ArduinoJson.h>
#include "Config.h"
#include "WiFiManager.h"
#include "LedController.h"
#include "SseClient.h"

// ========================================
// OBJETOS GLOBAIS
// ========================================
WiFiManager wifiManager;
LedController leds;
SseClient sse;

// Documento JSON reutilizado (com filtro) + filtro — globais para não estourar
// a pilha do loop() do ESP8266.
StaticJsonDocument<JSON_FILTER_SIZE> g_filter;
StaticJsonDocument<JSON_DOC_SIZE> g_doc;

unsigned long g_lastHeapLog = 0;

// ========================================
// Decisão de LEDs a partir do payload do evento "answer"
// ========================================
// payload é o buffer mutável do SseClient: o ArduinoJson parseia em zero-copy
// (chaves/strings apontam para o buffer, sem cópia no pool). As strings extraídas
// (ex.: answerText) são válidas durante toda esta função, pois o buffer só é
// reescrito no próximo evento.
void handleAnswer(char* payload) {
  g_doc.clear();
  DeserializationError err =
      deserializeJson(g_doc, payload, DeserializationOption::Filter(g_filter));

  if (err) {
    // Em vez de falhar em silêncio (que tornava esse tipo de bug invisível),
    // sinaliza nos próprios LEDs que um evento chegou mas não pôde ser exibido.
    Serial.print(F("[JSON] Erro ao parsear: "));
    Serial.println(err.c_str());
    leds.showError();
    return;
  }

  bool hasData = g_doc["hasData"] | false;
  const char* qt = g_doc["questionType"] | "";
  const char* answerText = g_doc["answerText"] | "";

  Serial.print(F("[ANSWER] questionType="));
  Serial.print(qt);
  Serial.print(F(" hasData="));
  Serial.print(hasData ? F("true") : F("false"));
  Serial.print(F(" answerText=\""));
  Serial.print(answerText);
  Serial.print(F("\""));
  if (g_doc["cached"] | false) {
    Serial.print(F(" (cache do servidor)"));
  }
  Serial.println();

  // 1) test => varredura de conectividade (não é resposta real).
  if (strcmp(qt, "test") == 0) {
    Serial.println(F("[ANSWER] evento de teste -> chase A->E"));
    leds.showTestChase();
    return;
  }

  // 2) ilegível => padrão de erro.
  if (!hasData) {
    Serial.println(F("[ANSWER] questão ilegível -> erro (5 LEDs piscando)"));
    leds.showError();
    return;
  }

  // 3) single / multiple => letras.
  if (strcmp(qt, "single") == 0 || strcmp(qt, "multiple") == 0) {
    JsonArray letters = g_doc["letters"];
    uint8_t pos[LED_COUNT];
    uint8_t n = 0;
    for (JsonVariant v : letters) {
      const char* s = v.as<const char*>();
      if (s && s[0] && !s[1]) {  // exatamente 1 caractere
        char c = toupper((unsigned char)s[0]);
        if (c >= 'A' && c <= 'E') {
          pos[n++] = (uint8_t)(c - 'A' + 1);
          if (n >= LED_COUNT) break;
        }
      }
    }
    if (n == 0) {
      Serial.println(F("[ANSWER] letras vazias/inválidas -> erro"));
      leds.showError();
      return;
    }
    if (strcmp(qt, "single") == 0) {
      leds.showSingle(pos[0]);
    } else {
      leds.showMultiple(pos, n);
    }
    return;
  }

  // 4a) yesno => flags (retido c/ TTL: Sim = fixo, Não = piscando, simultâneos).
  if (strcmp(qt, "yesno") == 0) {
    int slotCount = g_doc["slotCount"] | 0;
    JsonArray flagsArr = g_doc["flags"];
    bool flags[LED_COUNT];
    uint8_t n = 0;
    for (JsonVariant v : flagsArr) {
      if (n >= LED_COUNT) break;
      flags[n++] = v.as<bool>();
    }
    if (slotCount > LED_COUNT) {
      Serial.print(F("[ANSWER] yesno com slotCount="));
      Serial.print(slotCount);
      Serial.println(F(" — exibindo só as 5 primeiras (truncado)"));
    }
    leds.showYesNo(flags, n);
    return;
  }

  // 4b) dropdown / ordering / matching => slots (sequencial).
  if (strcmp(qt, "dropdown") == 0 || strcmp(qt, "ordering") == 0 ||
      strcmp(qt, "matching") == 0) {
    int slotCount = g_doc["slotCount"] | 0;
    JsonArray slotsArr = g_doc["slots"];
    uint8_t slots[LED_COUNT];
    uint8_t n = 0;
    for (JsonVariant v : slotsArr) {
      if (n >= LED_COUNT) break;
      // Validar ANTES de estreitar: (uint8_t)257 vira 1 e seria exibido como a
      // posição 1, com toda a confiança, em vez de sinalizar dado inválido.
      // Fora da faixa vira 0, que showSlots() já trata como slot inválido.
      const int raw = v.as<int>();
      const bool inRange = (raw >= 0 && raw <= 255);
      if (!inRange) {
        Serial.print(F("[ANSWER] slot fora da faixa: "));
        Serial.println(raw);
      }
      slots[n++] = inRange ? (uint8_t)raw : 0;
    }
    if (slotCount > LED_COUNT) {
      Serial.print(F("[ANSWER] slots com slotCount="));
      Serial.print(slotCount);
      Serial.println(F(" — exibindo só os 5 primeiros (truncado)"));
    }
    leds.showSlots(slots, n);
    return;
  }

  // questionType desconhecido => trata como erro.
  Serial.print(F("[ANSWER] questionType desconhecido: "));
  Serial.println(qt);
  leds.showError();
}

// ========================================
// Decisão de LEDs a partir do payload do evento "status"
// ========================================
// Sequência normal de um solve: solving -> answer -> idle. Em falha:
// solving -> error (sem answer). O idle que chega logo após um answer NÃO deve
// apagar a resposta — quem garante isso é LedController::stopProcessing(), que
// só age se o que está no ar é o próprio "processando".
void handleStatus(char* payload) {
  g_doc.clear();
  DeserializationError err =
      deserializeJson(g_doc, payload, DeserializationOption::Filter(g_filter));

  if (err) {
    // Diferente do answer, um status corrompido NÃO aciona leds.showError():
    // status é informativo e o padrão de erro é reservado às respostas (piscar
    // os 5 aqui faria o usuário ler "questão ilegível"). Fica registrado na serial.
    Serial.print(F("[JSON] Erro ao parsear status: "));
    Serial.println(err.c_str());
    return;
  }

  const char* state = g_doc["state"] | "";
  int activeSolves = g_doc["activeSolves"] | 0;

  Serial.print(F("[STATUS] state="));
  Serial.print(state);
  Serial.print(F(" activeSolves="));
  Serial.println(activeSolves);

  if (strcmp(state, "solving") == 0) {
    // Vence resposta segurada: há uma nova requisição em andamento.
    leds.showProcessing();
    return;
  }

  if (strcmp(state, "error") == 0) {
    // O backend manda a causa em "reason" (timeout, invalid_output,
    // upstream_error, internal_error). Sem isto o erro só piscava os 5 LEDs e a
    // serial não dizia por quê.
    const char* reason = g_doc["reason"] | "";
    Serial.print(F("[STATUS] falha no processamento"));
    if (reason[0]) {
      Serial.print(F(" (reason="));
      Serial.print(reason);
      Serial.print(F(")"));
    }
    Serial.println(F(" -> erro (5 LEDs piscando)"));
    leds.showError();
    return;
  }

  // idle — e qualquer state desconhecido, que a spec manda tratar como idle.
  leds.stopProcessing();
}

// ========================================
// SETUP
// ========================================
void setup() {
  Serial.begin(SERIAL_BAUD_RATE);
  delay(100);

  Serial.println(F("\n\n"));
  Serial.println(F("╔═══════════════════════════════════════════════╗"));
  Serial.println(F("║  CertMind - Cliente de Stream ESP8266         ║"));
  Serial.println(F("║  Versão: 2.5 (SSE)                            ║"));
  Serial.println(F("╚═══════════════════════════════════════════════╝"));

  leds.begin();

  // Filtro do ArduinoJson: parseia só o necessário (ignora explanation, que
  // pode ser longa), mantendo o documento pequeno.
  g_filter["hasData"] = true;
  g_filter["questionType"] = true;
  g_filter["letters"] = true;
  g_filter["flags"] = true;
  g_filter["slots"] = true;
  g_filter["slotCount"] = true;
  g_filter["answerText"] = true;
  g_filter["cached"] = true;  // resposta veio do cache do servidor (explica latência ~0)
  // Campos do evento status (o mesmo filtro serve aos dois eventos: chaves que
  // não existem no payload recebido são simplesmente ignoradas).
  g_filter["state"] = true;
  g_filter["activeSolves"] = true;
  g_filter["reason"] = true;  // causa curta do state=error (timeout, invalid_output, ...)

  // O filtro cresce a cada chave; sem este log, um estouro de JSON_FILTER_SIZE
  // apareceria como eventos que simplesmente param de acender os LEDs.
  Serial.print(F("[JSON] filtro: "));
  Serial.print(g_filter.memoryUsage());
  Serial.print(F("/"));
  Serial.print(JSON_FILTER_SIZE);
  Serial.println(F(" bytes"));

  // Conexão WiFi inicial (bloqueante apenas no boot); auto-reconnect cuida do resto.
  wifiManager.connect();
  WiFi.setAutoReconnect(true);

  sse.begin(handleAnswer, handleStatus);

  Serial.println(F("✓ Setup concluído. Aguardando stream...\n"));
}

// ========================================
// LOOP (não-bloqueante)
// ========================================
void loop() {
  unsigned long now = millis();

  // 1) Avança a animação dos LEDs.
  leds.update();

  // 2) Gerencia o stream (conexão/parsing/reconexão).
  sse.loop();

  // 3) Reflete a saúde do stream nos LEDs (só afeta quando não há resposta ativa).
  leds.setConnected(sse.isStreaming());

  // 4) Log periódico do heap (detecção de vazamento).
  if (now - g_lastHeapLog > STREAM_HEAP_LOG_MS) {
    g_lastHeapLog = now;
    Serial.print(F("[HEAP] livre="));
    Serial.println(ESP.getFreeHeap());
  }

  yield();  // alimenta o watchdog
}
